Revit 2027 API
Categories.IsEmpty Property
Whether or not the list of top-level categories is empty.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public override bool IsEmpty { get; }
Public Overrides ReadOnly Property IsEmpty As Boolean
	Get
public:
virtual property bool IsEmpty {
	bool get () override;
}
abstract IsEmpty : bool with get
override IsEmpty : bool with get
Property Value
Boolean
See Also
Reference
Categories Class
Autodesk.Revit.DB Namespace